Repository: seanpm2001/mt-training-data
Catalog: tn/tn_pontoon.tmx
Source language: en_us
Languages: tn

source: 2019 End-of-Year Release
tn: Tokololo ya Bofelo Jwa Ngwaga ya 2019

source: 2 down, keep it up!<playIcon></playIcon>
tn: O feditse tse 2, tshwara fela jalo!<playIcon></playIcon>

source: ≥ 2 No votes
tn: ≥ Ditlhopho tse 2 tsa Nnyaa

source: ≥ 2 Yes votes
tn: ≥ Ditlhopho tse 2 tsa Ee

source: Abbreviations and Acronyms. Abbreviations and acronyms like “USA” or “ICE” should be avoided in the source text because they may be read in a way that does not coincide with their spelling. Additionally, there may be multiple accurate readings for a single abbreviation. For example, the acronym “ICE” could be pronounced “I-C-E” or as a single word.
tn: Dikhutshwafatso. Dikhutshwafatso tse di jaaka “USA” kgotsa “ICE” di tshwanetse go tilwa mo mokwalong wa konokono gonne di ka balwa ka tsela e e sa dumalaneng le mopeleto wa tsone. Gape, go ka nna le ditsela di le mmalwa tse di nepileng tsa go bitsa khutshwafatso e le nngwe. Ka sekai, khutshwafatso “ICE” e ka bidiwa “I-C-E” kgotsa ya bidiwa jaaka lefoko le le lengwe.

source: About
tn: Ka ga

source: Accent
tn: Puo

source: Account
tn: Akhaonto

source: <accuracyLink>See more on accuracy criteria.</accuracyLink>
tn: <accuracyLink>Bona mo go oketsegileng ka ditlhoketso tsa go nepagala</accuracyLink>

source: Acehnese
tn: Se-Acehne

source: { $actionType }<playIcon></playIcon> did they accurately speak the sentence?
tn: { $actionType }<playIcon></playIcon> a ba buile mola ka tsela e e nepagetseng?

source: { $actionType }<recordIcon></recordIcon> then read the sentence aloud
tn: { $actionType }<recordIcon></recordIcon> o bo o balela mola kwa godimo

source: { $actionType }<stopIcon></stopIcon> when done
tn: { $actionType }<stopIcon></stopIcon> fa o feditse

source: { $actionType } submit when ready
tn: { $actionType } e romele fa e setse e siametse

source: Add
tn: Tsenya

source: Add a language you want to contribute to
tn: Tsenya puo e o batlang go thusa ka yone

source: Add as much information as you can about the language. This could include:
tn: Tsenya tshedimosetso e ntsi ka fa o ka kgonang ka teng ka puo. Seno se ka akaretsa:

source: Adding languages to work with
tn: Go tsenya dipuo tse o ka dirang ka tsone

source: Additional Language
tn: Puo e Nngwe Gape

source: Add Language
tn: Tsenya Puo

source: <addLink>Add more sentences now!</addLink>
tn: <addLink>Tsenya mela e e oketsegileng jaanong!</addLink>

source: Add new custom accent "{ $inputValue }"
tn: Tsenya puo e ntšha e e tlwaelegileng "{ $inputValue }"

source: Add new sentences
tn: Tsenya dipolelo tse disha

source: Add Sentences
tn: Tsenya Dipolelo

source: Add <wikipediaLink>public domain</wikipediaLink> sentences
tn: Tsenya mela ya <wikipediaLink>lefelo la botlhe</wikipediaLink>

source: Add Your Voice
tn: Tsenya Lentswe la Gago

source: Adyghe
tn: Se-Adyghe

source: Afaan Ormoo
tn: Se-Afaan Ormoo

source: A few bytes
tn: Dibaete di le mmalwa

source: Afrikaans
tn: Se-Afrikaans

source: Age
tn: Dingwaga

source: Albanian
tn: Se-Albania

source: All
tn: Tsotlhe

source: All sentences you submit must be under <wikipediaLink>Public Domain (CC-0) license</wikipediaLink>. To support the inclusion of work not under public licence, we have created a <cc0WaiverLink>Contributions Agreement template</cc0WaiverLink> for works where the copyright owner would like to contribute the material to Common Voice.
tn: Dipolelo tsotlhe tse o di romelang di tshwanetse tsa nna kafa tlase ga laesense ya </wikipediaLink>Lefelo la Botlhe (CC-0)<wikipediaLink>. Go tshegetsa go akarediwa ga tiro e e seng kafa tlase ga laesense ya puso, re dirile <cc0WaiverLink>thempoleite ya Tumalano ya Dikabo</cc0WaiverLink> go dira ditiro tse mong wa tetlokhopi a batlang go di abela Common Voice.

source: All voice clips in the dataset are scrubbed of personally identifying information. When a contributor provides demographic data via their profile, that information is de-identified from their voice clips before being bundled for download in the dataset and is never made public on their profile page.
tn: Dikgatiso tsotlhe tsa mantswe mo tshedimosetsong di tlositswe tshedimosetso e e senolang gore motho ke mang. Fa moabi a naya tshedimosetso ya dipalopalo ka porofaele ya gagwe, tshedimosetso eo e a tloswa mo dikgatisong tsa bone tsa mantswe pele di direlwa go ka itseelwa mo tshedimosetsong mme ga e dirwe ya batho botlhe mo tsebeng ya bone ya porofaele.

source: Amharic
tn: Se-Amharic

source: Anonymized user data like age, gender, and accent helps improve the audio data used to train the accuracy of speech recognition engines. Your username and email will never be associated with your submitted data, and you can choose whether to make your username public or anonymous.
tn: Tshedimosetso ya botlhokaina jaaka dingwaga, bong le segalo di tla thusa go tokafatsa go nepa ga didirisiwa tsa go lemoga mantswe. Leinatiriso le imeile ya gago di ka se amanngwe le tshedimosetso ya gago e e rometsweng, mme o ka tlhopha gore a o batla go senola kgotsa go fitlha leinatiriso la gago.

source: Approve
tn: Amogela

source: A quiet background hubbub is OK, but we don’t want additional voices that may cause a machine algorithm to identify words that are not in the written text. If you can hear distinct words apart from those of the text, the clip should be rejected. Typically this happens where the TV has been left on, or where there is a conversation going on nearby.
tn: Tlhakatlhakano e e utlwalang mo lefelong le le didimetseng e siame, mme ga re batle mantswe a a oketsegileng a a ka dirang gore motšhine o se ka wa lemoga mafoko a a sa kwalwang. Fa o ka utlwa mafoko a a farologaneng le a a kwadilweng, kgatiso eo e tshwanetswe go ganwa. Gantsi seno se direga fa TV e tlogetswe e tshubilwe, kgotsa fa go na le motlotlo o o tsweletseng fa gaufi.

source: Arabic
tn: Se-Arabia

source: Aragonese
tn: Se-Aragon

source: Are you coming? <strong>[called by another]</strong>
tn: A o etla? <strong>[called by another]</strong>

source: Armenian
tn: Se-Armania

source: Armenian Western
tn: Se-Armenia sa Bophirima

source: Ask about a new language
tn: Botsa ka puo e ntšha

source: Assamese
tn: Se-Assam

source: Asturian
tn: Se-Asturia

source: Audio Format
tn: Fomate ya modumo

source: Avatar
tn: Setshwantsho

source: Avatar uploaded
tn: Setshwantsho se tsentswe

source: Average
tn: Palogare

source: A voice clip is marked "valid" when a user gives it a Yes vote.
tn: Kgatiso ya lentswe e tshwaiwa e "siame" fa modirisi a e neile tlhopho ya Ee.

source: Avoid too much background noise - it should be easy to hear you.
tn: Tila medumo e mentsi e e mo lemoragong - go tshwanetse ga nna motlhofo go go utlwa.

source: Awards
tn: Dikgele

source: Azerbaijani
tn: Se-Azerbaijan

source: Back
tn: Morago

source: Background Noise
tn: Modumo kwa Lemoragong

source: Background Voices
tn: Mantswe mo Lemoragong

source: Back to Top
tn: Boela Kwa Godimo

source: Basaa
tn: Se-Basaa

source: Bashkir
tn: Se-Bashkir

source: Basque
tn: Se-Basque

source: Be cautious before rejecting a clip on the ground that the reader has mispronounced a word, has put the stress in the wrong place, or has apparently ignored a question mark. There are a wide variety of pronunciations in use around the world, some of which you may not have heard in your local community. Please provide a margin of appreciation for those who may speak differently from you.
tn: Nna kelotlhoko pele o gana kgatiso ka go bo mmadi a sa bitsa lefoko sentle, o gateletse mo lefelong le e seng lone, kgotsa gongwe o itlhokomolositse letshwao la potso. Go na le ditsela tse dintsi tsa go bitsa mafoko lefatshe ka bophara, tse dingwe ka tsone o ka tswang o ise o di utlwe mo lefelong la gago. Tsweetswee anaanela ba ba ka tswang ba bua ka tsela e e farologaneng le e o buang ka yone.

source: Belarusian
tn: Se-Belarus

source: Benefits
tn: Mesola

source: Bengali
tn: Se-Bengali

source: [‘Beret’ is OK whether with stress on the first syllable (UK) or the second (US)]
tn: [‘Berethe’ e siame le fa go gatelelwa ditlhaka tsa ntlha (UK) kgotsa tsa bofelo (US)]

source: <bold>{ $count }</bold> Clips
tn: <bold>{ $count }</bold> Dikgatiso

source: <bold>Help us</bold> find more voices
tn: <bold>Re thuse</bold> go bona mantswe a a oketsegileng

source: Bosnian
tn: Se-Bosnia

source: Both
tn: Ka bobedi

source: Both (Speak and Listen)
tn: Ka bobedi (Go Bua le go Reetsa)

source: Breton
tn: Se-Breton

source: Browse Languages
tn: Leba Dipuo

source: Build a custom goal
tn: Itirele boikaelelo jo o ka bo kgonang

source: Build Profile
tn: Aga Porofaele

source: Bulgarian
tn: Se-Bulgaria

source: Burmese
tn: Se-Burma

source: Buryat
tn: Se-Buryat

source: <b>Why an email?</b> We may need to contact you in the future about changes to the dataset, an email provides us a point of contact.
tn: <b>Goreng imeile?</b> Re ka tlhoka go ikgolaganya le wena mo isagweng fa go ka nna le diphetogo dingwe mo tshedimosetsong eno, imeile ke tsela e re ikgolaganyang le wena ka yone.

source: By editing your goal, you may lose your existing progress.
tn: Fa o baakanya maikaelelo a gago, o ka nna wa latlhegelwa ke kgatelopele ya gago e e gone.

source: By opting in to receive emails you state that you are okay with Mozilla handling this info as explained in Mozilla’s <privacyLink>Privacy Policy</privacyLink>.
tn: Ka go tlhopha go amogela diimeile o bontsha gore o siame ka gore Mozilla e tshware tshedimosetso eno jaaka go tlhalosiwa mo <privacyLink>Pholising ya Polokodiphiri</privacyLink>ya Mozilla.

source: <b>You agree</b> to not attempt to determine the identity of speakers in the Common Voice dataset
tn: <b>O dumela</b>go sa leke go lemoga boikitsiso jwa babui ba ba mo rekotong ya tshedimosetso ya Common Voice

source: By providing some information about yourself, the audio data you submit to Common Voice will be more useful to Speech Recognition engines that use this data to improve their accuracy.
tn: Ka go naya tshedimosetso nngwe ka wena, tshedimosetso ya lentswe e o e romelang kwa Common Voice e tla nna mosola thata mo dithulaganyong tsa Speech Recognition tse di dirisang tshedimosetso eno go tokafatsa go nepa ga tsone.

source: By using Common Voice, you agree to our <termsLink>Terms</termsLink> and <privacyLink>Privacy Notice</privacyLink>
tn: Ka go dirisa Common Voice, o dumalana le <termsLink>Melawana</termsLink> le <privacyLink>Kitsiso ya Polokodiphiri</privacyLink>

source: Cancel Re-recording
tn: Khansela go Rekota Sesha

source: Cancel Submission
tn: Khansela go Romela

source: Can't decide?
tn: Ga o kgone go dira tshwetso?

source: Cantonese
tn: Se-Canton

source: Catalan
tn: Se-Catalan

source: Central Kurdish
tn: Se-Central Kurdish

source: Change your email via Settings under Login Identity
tn: Fetola imeile ya gago ka Diseting mo tlase ga Boitshupo Jwa go Tsena

source: Check if your language is listed on the <languagesPageLink>Common Voice Languages page</languagesPageLink>. If not, fill out this form and we’ll <strong>send you a handy email explaining how to get your language set up</strong>.
tn: Tlhola gore a puo ya gago e kwadilwe mo lenaaneng la <languagesPageLink>tsebe ya Dipuo Tsa Common Voice</languagesPageLink>. Fa e seyo, tlatsa foromo eno mme re tla go <strong>romelela imeile e e tlhalosang gore o ka tsenya puo ya gago jang</strong>.

source: <chevron></chevron>See less
tn: <chevron></chevron>Bona tse di fokoditsweng

source: <chevron></chevron>See more
tn: <chevron></chevron>Bona tse di oketsegileng

source: Chinese (China)
tn: Se-China (China)

source: Chinese (Hong Kong)
tn: Se-China (Hong Kong)

source: Chinese (Taiwan)
tn: Se-China (Taiwan)

source: Choose language/localization
tn: Tlhopa puo/go dira go nne ga lefelo

source: Chuvash
tn: Se-Chuvash

source: Click
tn: Tobetsa

source: { $clipCount } voice clips, total archive size { $size }. Expires { $expires }.
tn: Dikgatiso tsa mantswe tse { $clipCount }, bogolo jotlhe jwa akhaefe { $size }. E felelwa ke nako { $expires }.

source: Clip Graveyard
tn: Lebitla la Bidio

source: Clips recorded
tn: Dikgatiso di dirilwe

source: Clips Uploaded
tn: Dibidio di tsentswe

source: Clips validated
tn: Dikgatiso di tlhomamisitswe

source: Clips You've Recorded
tn: Dibidio tse o di Rekotileng

source: Clips You've Validated
tn: Dibidio Tse o di Tlhomamisitseng

source: Close
tn: Tswala

source: Collecting sentences
tn: Go phutha dipolelo

source: Collecting sentences from the public domain, or writing new ones for the public domain.
tn: Go amogela mela go tswa mo lefelong la batho botlhe, kgotsa go kwalela lefelo la batho botlhe e mesha.

source: Collect sentences
tn: Phutha dipolelo

source: Comment
tn: Tshwaelo

source: Common Voice data plus all other voice datasets above.
tn: Tshedimosetso ya Common Voice le direkoto tsotlhe tsa tshedimosetso ya mantswe fa godimo.

source: Common Voice Dataset
tn: Rekoto ya Tshedimosetso ya Common Voice

source: Common Voice is a crowdsourcing platform, and the languages were all added by volunteers. We would love for you to add your language! <languageRequestLink>Ask about adding your language.</languageRequestLink>
tn: Common Voice ke thulaganyo e e batlang batho ba bantsi, mme dipuo tsotlhe di tsentswe ke baithaopi. Re ka rata go tsenya puo ya gago! <languageRequestLink>Botsa ka go tsenya puo ya gago.</languageRequestLink>

source: Common Voice is Mozilla's initiative to help teach machines how real people speak.
tn: Common Voice ke letsholo la Mozilla la go thusa go ruta metšhine gore batho ba mmatota ba bua jang.

source: Common Voice is part of Mozilla's initiative to help teach machines how real people speak.
tn: Common Voice ke karolo ya letsholo la Mozilla la go thusa go ruta metšhine gore batho ba mmatota ba bua jang.

source: Common Voice is the world’s largest publicly available, multi-language voice dataset.
tn: Common Voice ke rekoto ya tshedimosetso ya mantswe ya dipuo tse dintsi e batho mo lefatsheng lotlhe ba kgonang go e fitlhelela.

source: Common Voice recordings are used by academics, small businesses, and voice recognition enthusiasts to help train and grow publicly available resources like voice models. Can you let us know why you would like your recordings deleted?
tn: Dikgatiso tsa Common Voice di dirisiwa ke barutegi, dikgwebo tse dinnye, le batho ba ba tlhagafalelang go lemoga mantswe go thusa go thapisa le go godisa didirisiwa tse di leng teng gotlhe jaaka dikao tsa mantswe. A o ka re bolelela gore ke eng o batla gore dikgatiso tsa gago di phimolwe?

source: Community participation and decision making.
tn: Go tsaya karolo le go dira ditshwetso ga baagi.

source: Community Playbook
tn: Buka ya Motshameko ya Baagi

source: Confirm
tn: Tlhomamisa

source: Confirm Goal
tn: Tlhomamisa Maikaelelo

source: Confirm New Sentences
tn: Tlhomamisa Dipolelo Tse Disha

source: Connect with Gravatar
tn: Golagana le Setshwantsho

source: Contact
tn: Ikgolaganye

source: Contact Form
tn: Foromo ya go Ikgolaganya le Rona

source: Content available under a <licenseLink>Creative Commons license</licenseLink>
tn: Diteng di gone mo <licenseLink> laesenseng ya Creative Commons</licenseLink>

source: Continue
tn: Tswelela

source: Contribute
tn: Aba

source: Contribute sentences
tn: Aba mela

source: Contribute to { $lang }
tn: Abela { $lang }

source: Contribute Your Voice
tn: Abelana ka Lentswe la Gago

source: Contribution Activity
tn: Tiro ya go Aba

source: Contribution Criteria
tn: Dintlha tsa go Aba

source: Contribution Experience
tn: Maitemogelo a go Aba

source: Contributors record voice clips by reading from a bank of donated sentences.
tn: Batsayakarolo ba gatisa mantswe a bone ka go bala mo bontsintsing jwa mela e e abilweng.

source: Cookies
tn: Dikhukhi

source: <coquiLink>Coqui</coquiLink> is dedicated to open speech technology. Their projects include deep learning based STT and TTS engines.
tn: <coquiLink>Coqui</coquiLink> e ineetse mo thekenolojing ya go dirisa puo. Diporojeke tsa bone di akaretsa thuto e e tseneletseng e e ikaegileng ka mefuta ya STT le TTS.

source: Cornish
tn: Se-Cornwall

source: Corsican
tn: Se-Corsica

source: Could not add language
tn: Ga ya kgona go tsenya puo

source: Could not change settings. Please try again.
tn: Ga re a kgona go fetola diseting. Tsweetswee leka gape.

source: Could not remove language
tn: Ga ya kgona go ntsha puo

source: Could not remove language: language not found
tn: Ga re a kgona go ntsha puo: puo ga e a bonwa

source: { $countOfInvalidated } rejected by you
tn: { $countOfInvalidated } e gannwe ke wena

source: { $countOfReviewed } sentences are already reviewed. Great job!
tn: Mela e { $countOfReviewed } e setse e sekasekilwe. O berekile!

source: { $countOfSentences } sentences found.
tn: Go fitlhetswe mela e le { $countOfSentences }.

source: { $countOfUnreviewed } sentences are unreviewed. If you want, you can also review your sentences now before submitting them.
tn: Mela e le { $countOfUnreviewed } ga e ise e sekasekwe. Fa o batla, o ka nna wa sekaseka mela ya gago gone jaanong pele o e romela.

source: Create a Custom Goal
tn: Itirele Boikaelelo Jo o Ka bo Kgonang

source: Creating opportunities for a diversity of people to contribute to Common Voice ensures the dataset serves as many people as possible. We’ve created resources and templates that you can use!
tn: Go dira ditshono tsa gore batho ba bantsi ba nne le seabe mo Common Voice go tlhomamisa gore tshedimosetso e thusa batho ba bantsi kafa go ka kgonegang ka gone. Re dirile didirisiwa le dithempoleite tse o ka di dirisang.

source: Criteria
tn: Mokgwa

source: Croatian
tn: Se-Croatia

source: Czech
tn: Se-Czech

source: Daily Goal
tn: Boikaelelo jwa Letsatsi

source: Danish
tn: Se-Denmark

source: Dashboard
tn: Desheboto

source: Dataset Release
tn: Go Golola Rekoto ya Tshedimosetso

source: Datasets
tn: Direkoto tsa tshedimosetso

source: Date
tn: Letlha

source: Days
tn: Malatsi

source: De-identified
tn: Go tlosiwa tshedimosetso e e go tlhaolang

source: Delete my recordings
tn: Phimola dikgatiso tsa me

source: Delete Profile
tn: Phimola Porofaele

source: Delete selected sentences
tn: Phimola dipolelo tse di tlhophilweng

source: Deleting selected sentences…
tn: E phimola dipolelo tse di tlhophilweng...

source: Dhivehi
tn: Se-Dhivehi

source: Different language
tn: Puo e e farologaneng

source: Difficult
tn: Thata

source: Difficult to pronounce
tn: Go thata go le bitsa

source: Dioula
tn: Se-Dioula

source: Discard ongoing recording
tn: Latlha kgatiso e e ntseng e tsweletse

source: Donate your voice
tn: Abelana ka lentswe la gago

source: Don't see your language on Common Voice yet?
tn: A ga o ise o bone puo ya gago mo Common Voice?

source: Don’t see your language reflected in the Dataset? To request a language head over to our Languages page.
tn: Ga o bone puo ya gago e tlhaga mo Rekotong ya Tshedimosetso? Go kopa puo, ya kwa tsebeng ya rona ya Dipuo.

source: Download
tn: Itseele

source: Download Common Voice Data
tn: Itseele Tshedimosetso ya Common Voice

source: Download Data
tn: Itseele Tshedimosetso

source: Download Dataset Bundle
tn: Itseele Di-bundle Tsa Rekoto ya Tshedimosetso

source: Download { $language }
tn: Itseele { $language }

source: Download Links
tn: Itseele Dilinki

source: Download My Data
tn: Itseele Tshedimosetso ya Me

source: Download profile data
tn: Itseele tshedimosetso ya porofaele

source: Download the Single Word Target Segment
tn: Itseele Dikarolwana Tsa Lefoko le le Lengwe la Puo

source: Do you have ideas on how we can make the Common Voice dataset better? Let us know on Discourse
tn: A o na le dikakantsho tsa gore re ka tokafatsa jang direkoto tsa tshedimosetso ya Common Voice? Re itsise mo Discourse

source: Do you want to continue?
tn: A o batla go tswelela?

source: Do you want to Speak, Listen or both?
tn: A o batla go Bua, go Reetsa kgotsa ka bobedi?

source: Drag and drop or <browseWrap>Browse</browseWrap>
tn: E goge o bo o e latlhela kgotsa o <browseWrap>Senke</browseWrap>

source: During contribution submission feedback will be skipped after clicking 'Submit'. Contribution will continue directly with the next set of 5 recordings or validations.
tn: Ka nako ya thomelo ya dikabo, maikutlo a tla tlolwa morago ga go tobetsa 'Romela'. Kabo e tla tswelela ka tlhamalalo ka dikgatiso kgotsa ditlhomamiso tse 5 tse di latelang.

source: Dutch
tn: Sedatšhe

source: Each entry in the dataset consists of a unique MP3 and corresponding text file. Many of the <b>{ $total }</b> recorded hours in the dataset also include demographic metadata like age, sex, and accent that can help train the accuracy of speech recognition engines. The dataset currently consists of <b>{ $valid }</b> validated hours in <b>{ $languages }</b> languages, but we’re always adding more voices and languages. Take a look at our <languagesLink>Languages page</languagesLink> to request a language or start contributing.
tn: Matseno mangwe le mangwe mo tshedimosetsong a na le MP3 e e tlhomologileng le faele e e tsamaisanang le yone ya mokwalo. Bontsi jwa diura tse <b>{ $total }</b> tse di gatisitsweng mo tshedimosetsong le tsone di akaretsa tshedimosetso ya dipalopalo jaaka dingwaga, bong, le segalo se se ka thusang go thapisa go nepa ga dithulaganyo tse di lemogang mantswe. Ga jaana tshedimosetso e na le diura tse <b>{ $valid }</b> tse di tlhomamisitsweng mo dipuong tse <b>{ $languages }</b>, mme ka metlha re tsenya mantswe le dipuo tse di oketsegileng. Leba <languagesLink>tsebe ya rona ya Dipuo</languagesLink> go kopa puo kgotsa go simolola go aba.

source: Easy
tn: Motlhofo

source: Edit
tn: Baakanya

source: Edit Profile
tn: Baakanya Porofaele

source: Email
tn: Imeile

source: <emailFragment>Sign up</emailFragment> to our mailing list to learn how you can take part in campaigns, events and co-design features on Common Voice.
tn: <emailFragment>Ikwadise</emailFragment> mo lenaaneng la rona la melaetsa go ithuta gore o ka tsaya karolo jang mo matsholong, mo ditiragalong le mo dikarolong tsa go tlhama mo Common Voice.

source: Email is already used for a different account
tn: Imeile e setse e dirisitswe mo akhaonteng e nngwe

source: Email Subscriptions
tn: Dipeeletso tsa Imeile

source: English
tn: Seesemane

source: Enter Email to Download
tn: Tsenya Email Gore o Itseele

source: Enter email to send a sign up link
tn: Tsenya imeile gore o romelelwe linki ya go ikwadisa

source: Enter your email
tn: Tsenya imeile ya gago.

source: Error { $code }
tn: Phoso { $code }

source: Error while fetching rejected sentences. Please try again.
tn: Go nnile le phoso fa go tsewa mela e e gannweng. Tsweetswee leka gape.

source: Error while fetching your sentences. Please try again.
tn: Go nnile le phoso fa go tsewa mela ya gago. Tsweetswee leka gape.

source: Erzya
tn: Se-Erzya

source: ESC
tn: Tswa

source: Esperanto
tn: Se-Esperanto

source: Estonian
tn: Se-Estonia

source: Events
tn: Ditiragalo

source: Everyone
tn: Mongwe le mongwe

source: Exit & Delete clips
tn: Tswa & Phimola dikgatiso

source: Expert linguists can also help, try to reach out to local linguistic universities (both teachers and students) and see if they can help to gather a diverse set of sound-diverse sentences in your language.
tn: Baitseanape ba baitsepuo le bone ba ka thusa, leka go ikgolaganya le diyunibesithi tsa selegae tsa baitsepuo (barutisi le baithuti) mme o bone gore a ba ka thusa go kgobokanya dipolelo tse di farologaneng tsa medumo ka puo ya gago.

source: Failed to delete selected sentences… Please try again!
tn: Ga re a kgona go phimola mela e e tlhophilweng... Tsweetswee leka gape!

source: FAQ
tn: Dipotso tse Gantsi di Bodiwang

source: Faroese
tn: Se-Faroe

source: Female
tn: Basadi

source: Fields marked with an asterisk (*) are required.
tn: Dikarolo tse di tshwailweng ka naletsana (*) di a tlhokega.
